Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
form1.11.0:               - configmaps
17:35:03.543 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.543 STDOUT terraform1.11.0:               - services
17:35:03.543 STDOUT terraform1.11.0:               - persistentvolumeclaims
17:35:03.543 STDOUT terraform1.11.0:               - persistentvolumes
17:35:03.543 STDOUT terraform1.11.0:               verbs:
17:35:03.543 STDOUT terraform1.11.0:               - '*'
17:35:03.543 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.543 STDOUT terraform1.11.0:               - policy
17:35:03.543 STDOUT terraform1.11.0:               resources:
17:35:03.543 STDOUT terraform1.11.0:               - poddisruptionbudgets
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - networking.k8s.io
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - networkpolicies
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - rbac.authorization.k8s.io
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - roles
17:35:03.544 STDOUT terraform1.11.0:               - rolebindings
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - kuberokafkas
17:35:03.544 STDOUT terraform1.11.0:               - kuberokafkas/status
17:35:03.544 STDOUT terraform1.11.0:               - kuberokafkas/finalizers
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - create
17:35:03.544 STDOUT terraform1.11.0:               - delete
17:35:03.544 STDOUT terraform1.11.0:               - get
17:35:03.544 STDOUT terraform1.11.0:               - list
17:35:03.544 STDOUT terraform1.11.0:               - patch
17:35:03.544 STDOUT terraform1.11.0:               - update
17:35:03.544 STDOUT terraform1.11.0:               - watch
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - apps
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - deployments
17:35:03.544 STDOUT terraform1.11.0:               - statefulsets
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - ""
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - secrets
17:35:03.544 STDOUT terraform1.11.0:               - configmaps
17:35:03.544 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.544 STDOUT terraform1.11.0:               - services
17:35:03.544 STDOUT terraform1.11.0:               - persistentvolumeclaims
17:35:03.544 STDOUT terraform1.11.0:               - persistentvolumes
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - job
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - batch
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - policy
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - poddisruptionbudgets
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - networking.k8s.io
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - networkpolicies
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - rbac.authorization.k8s.io
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - roles
17:35:03.544 STDOUT terraform1.11.0:               - rolebindings
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.544 STDOUT terraform1.11.0:               - '*'
17:35:03.544 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.544 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.544 STDOUT terraform1.11.0:               resources:
17:35:03.544 STDOUT terraform1.11.0:               - kuberomails
17:35:03.544 STDOUT terraform1.11.0:               - kuberomails/status
17:35:03.544 STDOUT terraform1.11.0:               - kuberomails/finalizers
17:35:03.544 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - create
17:35:03.545 STDOUT terraform1.11.0:               - delete
17:35:03.545 STDOUT terraform1.11.0:               - get
17:35:03.545 STDOUT terraform1.11.0:               - list
17:35:03.545 STDOUT terraform1.11.0:               - patch
17:35:03.545 STDOUT terraform1.11.0:               - update
17:35:03.545 STDOUT terraform1.11.0:               - watch
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - ""
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.545 STDOUT terraform1.11.0:               - services
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - '*'
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - apps
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - deployments
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - '*'
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - kuberorabbitmqs
17:35:03.545 STDOUT terraform1.11.0:               - kuberorabbitmqs/status
17:35:03.545 STDOUT terraform1.11.0:               - kuberorabbitmqs/finalizers
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - create
17:35:03.545 STDOUT terraform1.11.0:               - delete
17:35:03.545 STDOUT terraform1.11.0:               - get
17:35:03.545 STDOUT terraform1.11.0:               - list
17:35:03.545 STDOUT terraform1.11.0:               - patch
17:35:03.545 STDOUT terraform1.11.0:               - update
17:35:03.545 STDOUT terraform1.11.0:               - watch
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - apps
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - deployments
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - '*'
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - ""
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.545 STDOUT terraform1.11.0:               - services
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - '*'
17:35:03.545 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.545 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.545 STDOUT terraform1.11.0:               resources:
17:35:03.545 STDOUT terraform1.11.0:               - kuberomemcacheds
17:35:03.545 STDOUT terraform1.11.0:               - kuberomemcacheds/status
17:35:03.545 STDOUT terraform1.11.0:               - kuberomemcacheds/finalizers
17:35:03.545 STDOUT terraform1.11.0:               verbs:
17:35:03.545 STDOUT terraform1.11.0:               - create
17:35:03.545 STDOUT terraform1.11.0:               - delete
17:35:03.545 STDOUT terraform1.11.0:               - get
17:35:03.545 STDOUT terraform1.11.0:               - list
17:35:03.545 STDOUT terraform1.11.0:               - patch
17:35:03.545 STDOUT terraform1.11.0:               - update
17:35:03.546 STDOUT terraform1.11.0:               - watch
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - ""
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.546 STDOUT terraform1.11.0:               - services
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - apps
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - deployments
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - kuberoprometheuses
17:35:03.546 STDOUT terraform1.11.0:               - kuberoprometheuses/status
17:35:03.546 STDOUT terraform1.11.0:               - kuberoprometheuses/finalizers
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - create
17:35:03.546 STDOUT terraform1.11.0:               - delete
17:35:03.546 STDOUT terraform1.11.0:               - get
17:35:03.546 STDOUT terraform1.11.0:               - list
17:35:03.546 STDOUT terraform1.11.0:               - patch
17:35:03.546 STDOUT terraform1.11.0:               - update
17:35:03.546 STDOUT terraform1.11.0:               - watch
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - ""
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.546 STDOUT terraform1.11.0:               - services
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - apps
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - deployments
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - ""
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - clusterrolebindings
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - kuberobuilds
17:35:03.546 STDOUT terraform1.11.0:               - kuberobuilds/status
17:35:03.546 STDOUT terraform1.11.0:               - kuberobuilds/finalizers
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - create
17:35:03.546 STDOUT terraform1.11.0:               - delete
17:35:03.546 STDOUT terraform1.11.0:               - get
17:35:03.546 STDOUT terraform1.11.0:               - list
17:35:03.546 STDOUT terraform1.11.0:               - patch
17:35:03.546 STDOUT terraform1.11.0:               - update
17:35:03.546 STDOUT terraform1.11.0:               - watch
17:35:03.546 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.546 STDOUT terraform1.11.0:               - batch
17:35:03.546 STDOUT terraform1.11.0:               resources:
17:35:03.546 STDOUT terraform1.11.0:               - jobs
17:35:03.546 STDOUT terraform1.11.0:               verbs:
17:35:03.546 STDOUT terraform1.11.0:               - '*'
17:35:03.547 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.547 STDOUT terraform1.11.0:               - ""
17:35:03.547 STDOUT terraform1.11.0:               resources:
17:35:03.547 STDOUT terraform1.11.0:               - pods
17:35:03.547 STDOUT terraform1.11.0:               verbs:
17:35:03.547 STDOUT terraform1.11.0:               - '*'
17:35:03.547 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.547 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.547 STDOUT terraform1.11.0:               resources:
17:35:03.547 STDOUT terraform1.11.0:               - kuberoaddonmysqls
17:35:03.547 STDOUT terraform1.11.0:               - kuberoaddonmysqls/status
17:35:03.547 STDOUT terraform1.11.0:               - kuberoaddonmysqls/finalizers
17:35:03.547 STDOUT terraform1.11.0:               verbs:
17:35:03.547 STDOUT terraform1.11.0:               - create
17:35:03.547 STDOUT terraform1.11.0:               - delete
17:35:03.547 STDOUT terraform1.11.0:               - get
17:35:03.547 STDOUT terraform1.11.0:               - list
17:35:03.547 STDOUT terraform1.11.0:               - patch
17:35:03.547 STDOUT terraform1.11.0:               - update
17:35:03.547 STDOUT terraform1.11.0:               - watch
17:35:03.547 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.547 STDOUT terraform1.11.0:               - ""
17:35:03.547 STDOUT terraform1.11.0:               resources:
17:35:03.547 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.547 STDOUT terraform1.11.0:               - services
17:35:03.547 STDOUT terraform1.11.0:               verbs:
17:35:03.547 STDOUT terraform1.11.0:               - '*'
17:35:03.547 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.547 STDOUT terraform1.11.0:               - apps
17:35:03.547 STDOUT terraform1.11.0:               resources:
17:35:03.547 STDOUT terraform1.11.0:               - deployments
17:35:03.547 STDOUT terraform1.11.0:               verbs:
17:35:03.547 STDOUT terraform1.11.0:               - '*'
17:35:03.547 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.547 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.547 STDOUT terraform1.11.0:               resources:
17:35:03.547 STDOUT terraform1.11.0:               - kuberoaddonpostgres
17:35:03.548 STDOUT terraform1.11.0:               - kuberoaddonpostgres/status
17:35:03.548 STDOUT terraform1.11.0:               - kuberoaddonpostgres/finalizers
17:35:03.548 STDOUT terraform1.11.0:               verbs:
17:35:03.548 STDOUT terraform1.11.0:               - create
17:35:03.548 STDOUT terraform1.11.0:               - delete
17:35:03.548 STDOUT terraform1.11.0:               - get
17:35:03.548 STDOUT terraform1.11.0:               - list
17:35:03.548 STDOUT terraform1.11.0:               - patch
17:35:03.548 STDOUT terraform1.11.0:               - update
17:35:03.548 STDOUT terraform1.11.0:               - watch
17:35:03.548 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.548 STDOUT terraform1.11.0:               - ""
17:35:03.548 STDOUT terraform1.11.0:               resources:
17:35:03.548 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.548 STDOUT terraform1.11.0:               - services
17:35:03.548 STDOUT terraform1.11.0:               verbs:
17:35:03.548 STDOUT terraform1.11.0:               - '*'
17:35:03.548 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.548 STDOUT terraform1.11.0:               - apps
17:35:03.548 STDOUT terraform1.11.0:               resources:
17:35:03.548 STDOUT terraform1.11.0:               - deployments
17:35:03.548 STDOUT terraform1.11.0:               verbs:
17:35:03.548 STDOUT terraform1.11.0:               - '*'
17:35:03.548 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.548 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.548 STDOUT terraform1.11.0:               resources:
17:35:03.548 STDOUT terraform1.11.0:               - kuberoaddonredis
17:35:03.548 STDOUT terraform1.11.0:               - kuberoaddonredis/status
17:35:03.548 STDOUT terraform1.11.0:               - kuberoaddonredis/finalizers
17:35:03.548 STDOUT terraform1.11.0:               verbs:
17:35:03.548 STDOUT terraform1.11.0:               - create
17:35:03.548 STDOUT terraform1.11.0:               - delete
17:35:03.549 STDOUT terraform1.11.0:               - get
17:35:03.549 STDOUT terraform1.11.0:               - list
17:35:03.549 STDOUT terraform1.11.0:               - patch
17:35:03.549 STDOUT terraform1.11.0:               - update
17:35:03.549 STDOUT terraform1.11.0:               - watch
17:35:03.549 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.549 STDOUT terraform1.11.0:               - ""
17:35:03.549 STDOUT terraform1.11.0:               resources:
17:35:03.549 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.549 STDOUT terraform1.11.0:               - services
17:35:03.549 STDOUT terraform1.11.0:               verbs:
17:35:03.549 STDOUT terraform1.11.0:               - '*'
17:35:03.549 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.549 STDOUT terraform1.11.0:               - apps
17:35:03.549 STDOUT terraform1.11.0:               resources:
17:35:03.549 STDOUT terraform1.11.0:               - deployments
17:35:03.549 STDOUT terraform1.11.0:               verbs:
17:35:03.549 STDOUT terraform1.11.0:               - '*'
17:35:03.549 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.549 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.549 STDOUT terraform1.11.0:               resources:
17:35:03.549 STDOUT terraform1.11.0:               - kuberoaddonrabbitmqs
17:35:03.549 STDOUT terraform1.11.0:               - kuberoaddonrabbitmqs/status
17:35:03.549 STDOUT terraform1.11.0:               - kuberoaddonrabbitmqs/finalizers
17:35:03.549 STDOUT terraform1.11.0:               verbs:
17:35:03.549 STDOUT terraform1.11.0:               - create
17:35:03.549 STDOUT terraform1.11.0:               - delete
17:35:03.549 STDOUT terraform1.11.0:               - get
17:35:03.549 STDOUT terraform1.11.0:               - list
17:35:03.549 STDOUT terraform1.11.0:               - patch
17:35:03.549 STDOUT terraform1.11.0:               - update
17:35:03.549 STDOUT terraform1.11.0:               - watch
17:35:03.549 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.549 STDOUT terraform1.11.0:               - ""
17:35:03.549 STDOUT terraform1.11.0:               resources:
17:35:03.549 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.549 STDOUT terraform1.11.0:               - services
17:35:03.549 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - apps
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - deployments
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmongodbs
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmongodbs/status
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmongodbs/finalizers
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - create
17:35:03.550 STDOUT terraform1.11.0:               - delete
17:35:03.550 STDOUT terraform1.11.0:               - get
17:35:03.550 STDOUT terraform1.11.0:               - list
17:35:03.550 STDOUT terraform1.11.0:               - patch
17:35:03.550 STDOUT terraform1.11.0:               - update
17:35:03.550 STDOUT terraform1.11.0:               - watch
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - ""
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.550 STDOUT terraform1.11.0:               - services
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - apps
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - deployments
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - application.kubero.dev
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds/status
17:35:03.550 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds/finalizers
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - create
17:35:03.550 STDOUT terraform1.11.0:               - delete
17:35:03.550 STDOUT terraform1.11.0:               - get
17:35:03.550 STDOUT terraform1.11.0:               - list
17:35:03.550 STDOUT terraform1.11.0:               - patch
17:35:03.550 STDOUT terraform1.11.0:               - update
17:35:03.550 STDOUT terraform1.11.0:               - watch
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - ""
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - serviceaccounts
17:35:03.550 STDOUT terraform1.11.0:               - services
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.550 STDOUT terraform1.11.0:               - apps
17:35:03.550 STDOUT terraform1.11.0:               resources:
17:35:03.550 STDOUT terraform1.11.0:               - deployments
17:35:03.550 STDOUT terraform1.11.0:               verbs:
17:35:03.550 STDOUT terraform1.11.0:               - '*'
17:35:03.550 STDOUT terraform1.11.0:         EOT
17:35:03.550 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.551 STDOUT terraform1.11.0:     }
17:35:03.551 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[42] will be created
17:35:03.551 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.551 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:35:03.551 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.551 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.551 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.551 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.551 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.551 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:35:03.551 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.551 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.551 STDOUT terraform1.11.0:       + name                    = "kubero-operator-metrics-reader"
17:35:03.551 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:35:03.552 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.552 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.552 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.552 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.552 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.552 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.552 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:35:03.552 STDOUT terraform1.11.0:             kind: ClusterRole
17:35:03.552 STDOUT terraform1.11.0:             metadata:
17:35:03.553 STDOUT terraform1.11.0:               name: kubero-operator-metrics-reader
17:35:03.553 STDOUT terraform1.11.0:             rules:
17:35:03.553 STDOUT terraform1.11.0:             - nonResourceURLs:
17:35:03.553 STDOUT terraform1.11.0:               - /metrics
17:35:03.553 STDOUT terraform1.11.0:               verbs:
17:35:03.553 STDOUT terraform1.11.0:               - get
17:35:03.553 STDOUT terraform1.11.0:         EOT
17:35:03.553 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.553 STDOUT terraform1.11.0:     }
17:35:03.553 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[43] will be created
17:35:03.553 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.553 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:35:03.553 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.553 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.553 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.553 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.553 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.553 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:35:03.553 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.553 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.553 STDOUT terraform1.11.0:       + name                    = "kubero-operator-proxy-role"
17:35:03.553 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:35:03.553 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.554 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.554 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.554 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.554 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.554 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.554 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:35:03.554 STDOUT terraform1.11.0:             kind: ClusterRole
17:35:03.554 STDOUT terraform1.11.0:             metadata:
17:35:03.554 STDOUT terraform1.11.0:               name: kubero-operator-proxy-role
17:35:03.554 STDOUT terraform1.11.0:             rules:
17:35:03.554 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.554 STDOUT terraform1.11.0:               - authentication.k8s.io
17:35:03.554 STDOUT terraform1.11.0:               resources:
17:35:03.554 STDOUT terraform1.11.0:               - tokenreviews
17:35:03.554 STDOUT terraform1.11.0:               verbs:
17:35:03.554 STDOUT terraform1.11.0:               - create
17:35:03.554 STDOUT terraform1.11.0:             - apiGroups:
17:35:03.554 STDOUT terraform1.11.0:               - authorization.k8s.io
17:35:03.554 STDOUT terraform1.11.0:               resources:
17:35:03.554 STDOUT terraform1.11.0:               - subjectaccessreviews
17:35:03.554 STDOUT terraform1.11.0:               verbs:
17:35:03.554 STDOUT terraform1.11.0:               - create
17:35:03.554 STDOUT terraform1.11.0:         EOT
17:35:03.554 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.554 STDOUT terraform1.11.0:     }
17:35:03.554 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[44] will be created
17:35:03.554 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.554 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:35:03.554 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.554 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.554 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.555 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.555 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.555 STDOUT terraform1.11.0:       + kind                    = "RoleBinding"
17:35:03.555 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.555 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.555 STDOUT terraform1.11.0:       + name                    = "kubero-operator-leader-election-rolebinding"
17:35:03.555 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:35:03.555 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.555 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.555 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.555 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.555 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.555 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.555 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:35:03.556 STDOUT terraform1.11.0:             kind: RoleBinding
17:35:03.556 STDOUT terraform1.11.0:             metadata:
17:35:03.556 STDOUT terraform1.11.0:               name: kubero-operator-leader-election-rolebinding
17:35:03.556 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.556 STDOUT terraform1.11.0:             roleRef:
17:35:03.556 STDOUT terraform1.11.0:               apiGroup: rbac.authorization.k8s.io
17:35:03.556 STDOUT terraform1.11.0:               kind: Role
17:35:03.556 STDOUT terraform1.11.0:               name: kubero-operator-leader-election-role
17:35:03.556 STDOUT terraform1.11.0:             subjects:
17:35:03.556 STDOUT terraform1.11.0:             - kind: ServiceAccount
17:35:03.556 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager
17:35:03.556 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.556 STDOUT terraform1.11.0:         EOT
17:35:03.556 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.556 STDOUT terraform1.11.0:     }
17:35:03.556 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[45] will be created
17:35:03.556 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.556 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:35:03.556 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.556 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.556 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.557 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.557 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.557 STDOUT terraform1.11.0:       + kind                    = "ClusterRoleBinding"
17:35:03.557 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.557 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.557 STDOUT terraform1.11.0:       + name                    = "kubero-operator-manager-rolebinding"
17:35:03.557 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:35:03.557 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.557 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.557 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.557 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.557 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.557 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.557 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:35:03.557 STDOUT terraform1.11.0:             kind: ClusterRoleBinding
17:35:03.557 STDOUT terraform1.11.0:             metadata:
17:35:03.557 STDOUT terraform1.11.0:               name: kubero-operator-manager-rolebinding
17:35:03.557 STDOUT terraform1.11.0:             roleRef:
17:35:03.557 STDOUT terraform1.11.0:               apiGroup: rbac.authorization.k8s.io
17:35:03.557 STDOUT terraform1.11.0:               kind: ClusterRole
17:35:03.557 STDOUT terraform1.11.0:               name: kubero-operator-manager-role
17:35:03.557 STDOUT terraform1.11.0:             subjects:
17:35:03.557 STDOUT terraform1.11.0:             - kind: ServiceAccount
17:35:03.557 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager
17:35:03.557 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.557 STDOUT terraform1.11.0:         EOT
17:35:03.557 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.557 STDOUT terraform1.11.0:     }
17:35:03.557 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[46] will be created
17:35:03.557 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.558 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:35:03.558 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.558 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.558 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.558 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.558 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.558 STDOUT terraform1.11.0:       + kind                    = "ClusterRoleBinding"
17:35:03.558 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.558 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.558 STDOUT terraform1.11.0:       + name                    = "kubero-operator-proxy-rolebinding"
17:35:03.558 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:35:03.558 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.558 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.558 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.558 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.558 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.558 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.558 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:35:03.558 STDOUT terraform1.11.0:             kind: ClusterRoleBinding
17:35:03.558 STDOUT terraform1.11.0:             metadata:
17:35:03.558 STDOUT terraform1.11.0:               name: kubero-operator-proxy-rolebinding
17:35:03.558 STDOUT terraform1.11.0:             roleRef:
17:35:03.558 STDOUT terraform1.11.0:               apiGroup: rbac.authorization.k8s.io
17:35:03.558 STDOUT terraform1.11.0:               kind: ClusterRole
17:35:03.558 STDOUT terraform1.11.0:               name: kubero-operator-proxy-role
17:35:03.558 STDOUT terraform1.11.0:             subjects:
17:35:03.558 STDOUT terraform1.11.0:             - kind: ServiceAccount
17:35:03.558 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager
17:35:03.558 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.558 STDOUT terraform1.11.0:         EOT
17:35:03.558 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.559 STDOUT terraform1.11.0:     }
17:35:03.559 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[47] will be created
17:35:03.559 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.559 STDOUT terraform1.11.0:       + api_version             = "v1"
17:35:03.559 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.559 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.559 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.559 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.559 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.559 STDOUT terraform1.11.0:       + kind                    = "ConfigMap"
17:35:03.559 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.559 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.559 STDOUT terraform1.11.0:       + name                    = "kubero-operator-manager-config"
17:35:03.559 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:35:03.559 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.559 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.559 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.559 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.559 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.559 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.559 STDOUT terraform1.11.0:             apiVersion: v1
17:35:03.559 STDOUT terraform1.11.0:             data:
17:35:03.559 STDOUT terraform1.11.0:               controller_manager_config.yaml: |
17:35:03.559 STDOUT terraform1.11.0:                 apiVersion: controller-runtime.sigs.k8s.io/v1alpha1
17:35:03.559 STDOUT terraform1.11.0:                 kind: ControllerManagerConfig
17:35:03.559 STDOUT terraform1.11.0:                 health:
17:35:03.559 STDOUT terraform1.11.0:                   healthProbeBindAddress: :8081
17:35:03.559 STDOUT terraform1.11.0:                 metrics:
17:35:03.559 STDOUT terraform1.11.0:                   bindAddress: 127.0.0.1:8080
17:35:03.559 STDOUT terraform1.11.0:             
17:35:03.559 STDOUT terraform1.11.0:                 leaderElection:
17:35:03.559 STDOUT terraform1.11.0:                   leaderElect: true
17:35:03.559 STDOUT terraform1.11.0:                   resourceName: 811c9dc5.kubero.dev
17:35:03.559 STDOUT terraform1.11.0:             kind: ConfigMap
17:35:03.559 STDOUT terraform1.11.0:             metadata:
17:35:03.559 STDOUT terraform1.11.0:               name: kubero-operator-manager-config
17:35:03.559 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.560 STDOUT terraform1.11.0:         EOT
17:35:03.560 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.560 STDOUT terraform1.11.0:     }
17:35:03.560 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[48] will be created
17:35:03.560 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.560 STDOUT terraform1.11.0:       + api_version             = "v1"
17:35:03.560 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.560 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.560 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.560 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.560 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.560 STDOUT terraform1.11.0:       + kind                    = "Service"
17:35:03.560 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.560 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.560 STDOUT terraform1.11.0:       + name                    = "kubero-operator-controller-manager-metrics-service"
17:35:03.560 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:35:03.560 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.560 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.560 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.560 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.560 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.560 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.560 STDOUT terraform1.11.0:             apiVersion: v1
17:35:03.560 STDOUT terraform1.11.0:             kind: Service
17:35:03.560 STDOUT terraform1.11.0:             metadata:
17:35:03.560 STDOUT terraform1.11.0:               labels:
17:35:03.560 STDOUT terraform1.11.0:                 control-plane: controller-manager
17:35:03.560 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager-metrics-service
17:35:03.560 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.560 STDOUT terraform1.11.0:             spec:
17:35:03.560 STDOUT terraform1.11.0:               ports:
17:35:03.560 STDOUT terraform1.11.0:               - name: https
17:35:03.560 STDOUT terraform1.11.0:                 port: 8443
17:35:03.560 STDOUT terraform1.11.0:                 protocol: TCP
17:35:03.560 STDOUT terraform1.11.0:                 targetPort: https
17:35:03.560 STDOUT terraform1.11.0:               selector:
17:35:03.561 STDOUT terraform1.11.0:                 control-plane: controller-manager
17:35:03.561 STDOUT terraform1.11.0:         EOT
17:35:03.561 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.561 STDOUT terraform1.11.0:     }
17:35:03.561 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[49] will be created
17:35:03.561 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:35:03.561 STDOUT terraform1.11.0:       + api_version             = "apps/v1"
17:35:03.561 STDOUT terraform1.11.0:       + apply_only              = false
17:35:03.561 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:03.561 STDOUT terraform1.11.0:       + force_conflicts         = true
17:35:03.561 STDOUT terraform1.11.0:       + force_new               = false
17:35:03.561 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:03.561 STDOUT terraform1.11.0:       + kind                    = "Deployment"
17:35:03.561 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:03.561 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:03.561 STDOUT terraform1.11.0:       + name                    = "kubero-operator-controller-manager"
17:35:03.561 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:35:03.561 STDOUT terraform1.11.0:       + server_side_apply       = true
17:35:03.561 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:03.561 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:03.561 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:35:03.561 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:03.561 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:03.561 STDOUT terraform1.11.0:             apiVersion: apps/v1
17:35:03.561 STDOUT terraform1.11.0:             kind: Deployment
17:35:03.561 STDOUT terraform1.11.0:             metadata:
17:35:03.561 STDOUT terraform1.11.0:               labels:
17:35:03.561 STDOUT terraform1.11.0:                 control-plane: controller-manager
17:35:03.561 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager
17:35:03.561 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:35:03.561 STDOUT terraform1.11.0:             spec:
17:35:03.561 STDOUT terraform1.11.0:               replicas: 1
17:35:03.561 STDOUT terraform1.11.0:               selector:
17:35:03.561 STDOUT terraform1.11.0:                 matchLabels:
17:35:03.561 STDOUT terraform1.11.0:                   control-plane: controller-manager
17:35:03.562 STDOUT terraform1.11.0:               template:
17:35:03.562 STDOUT terraform1.11.0:                 metadata:
17:35:03.562 STDOUT terraform1.11.0:                   annotations:
17:35:03.562 STDOUT terraform1.11.0:                     kubectl.kubernetes.io/default-container: manager
17:35:03.562 STDOUT terraform1.11.0:                   labels:
17:35:03.562 STDOUT terraform1.11.0:                     control-plane: controller-manager
17:35:03.562 STDOUT terraform1.11.0:                 spec:
17:35:03.562 STDOUT terraform1.11.0:                   containers:
17:35:03.562 STDOUT terraform1.11.0:                   - args:
17:35:03.562 STDOUT terraform1.11.0:                     - --secure-listen-address=0.0.0.0:8443
17:35:03.562 STDOUT terraform1.11.0:                     - --upstream=http://127.0.0.1:8080/
17:35:03.562 STDOUT terraform1.11.0:                     - --logtostderr=true
17:35:03.562 STDOUT terraform1.11.0:                     - --v=0
17:35:03.562 STDOUT terraform1.11.0:                     image: gcr.io/kubebuilder/kube-rbac-proxy:v0.11.0
17:35:03.562 STDOUT terraform1.11.0:                     name: kube-rbac-proxy
17:35:03.562 STDOUT terraform1.11.0:                     ports:
17:35:03.562 STDOUT terraform1.11.0:                     - containerPort: 8443
17:35:03.562 STDOUT terraform1.11.0:                       name: https
17:35:03.562 STDOUT terraform1.11.0:                       protocol: TCP
17:35:03.562 STDOUT terraform1.11.0:                     resources:
17:35:03.562 STDOUT terraform1.11.0:                       limits:
17:35:03.562 STDOUT terraform1.11.0:                         cpu: 500m
17:35:03.562 STDOUT terraform1.11.0:                         memory: 128Mi
17:35:03.562 STDOUT terraform1.11.0:                       requests:
17:35:03.562 STDOUT terraform1.11.0:                         cpu: 5m
17:35:03.562 STDOUT terraform1.11.0:                         memory: 64Mi
17:35:03.562 STDOUT terraform1.11.0:                   - args:
17:35:03.562 STDOUT terraform1.11.0:                     - --health-probe-bind-address=:8081
17:35:03.562 STDOUT terraform1.11.0:                     - --metrics-bind-address=127.0.0.1:8080
17:35:03.562 STDOUT terraform1.11.0:                     - --leader-elect
17:35:03.562 STDOUT terraform1.11.0:                     - --leader-election-id=kubero-operator
17:35:03.562 STDOUT terraform1.11.0:                     - --zap-log-level=info
17:35:03.562 STDOUT terraform1.11.0:                     image: ghcr.io/kubero-dev/kubero-operator/kuberoapp:v0.2.2
17:35:03.562 STDOUT terraform1.11.0:                     livenessProbe:
17:35:03.562 STDOUT terraform1.11.0:                       httpGet:
17:35:03.562 STDOUT terraform1.11.0:                         path: /healthz
17:35:03.562 STDOUT terraform1.11.0:                         port: 8081
17:35:03.562 STDOUT terraform1.11.0:                       initialDelaySeconds: 15
17:35:03.562 STDOUT terraform1.11.0:                       periodSeconds: 20
17:35:03.562 STDOUT terraform1.11.0:                     name: manager
17:35:03.562 STDOUT terraform1.11.0:                     readinessProbe:
17:35:03.562 STDOUT terraform1.11.0:                       h
17:35:03.562 STDOUT terraform1.11.0: ttpGet:
17:35:03.562 STDOUT terraform1.11.0:                         path: /readyz
17:35:03.562 STDOUT terraform1.11.0:                         port: 8081
17:35:03.562 STDOUT terraform1.11.0:                       initialDelaySeconds: 5
17:35:03.563 STDOUT terraform1.11.0:                       periodSeconds: 10
17:35:03.563 STDOUT terraform1.11.0:                     resources:
17:35:03.563 STDOUT terraform1.11.0:                       limits:
17:35:03.563 STDOUT terraform1.11.0:                         cpu: 1000m
17:35:03.563 STDOUT terraform1.11.0:                         memory: 1Gi
17:35:03.563 STDOUT terraform1.11.0:                       requests:
17:35:03.563 STDOUT terraform1.11.0:                         cpu: 100m
17:35:03.563 STDOUT terraform1.11.0:                         memory: 64Mi
17:35:03.563 STDOUT terraform1.11.0:                     securityContext:
17:35:03.563 STDOUT terraform1.11.0:                       allowPrivilegeEscalation: false
17:35:03.563 STDOUT terraform1.11.0:                   securityContext:
17:35:03.563 STDOUT terraform1.11.0:                     runAsNonRoot: true
17:35:03.563 STDOUT terraform1.11.0:                   serviceAccountName: kubero-operator-controller-manager
17:35:03.563 STDOUT terraform1.11.0:                   terminationGracePeriodSeconds: 10
17:35:03.563 STDOUT terraform1.11.0:         EOT
17:35:03.563 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:03.563 STDOUT terraform1.11.0:     }
17:35:03.563 STDOUT terraform1.11.0:   # kubernetes_deployment.homer[0] will be updated in-place
17:35:03.563 STDOUT terraform1.11.0:   ~ resource "kubernetes_deployment" "homer" {
17:35:03.563 STDOUT terraform1.11.0:         id               = "platform/homer"
17:35:03.563 STDOUT terraform1.11.0:         # (1 unchanged attribute hidden)
17:35:03.563 STDOUT terraform1.11.0:       ~ spec {
17:35:03.563 STDOUT terraform1.11.0:             # (5 unchanged attributes hidden)
17:35:03.563 STDOUT terraform1.11.0:           ~ template {
17:35:03.563 STDOUT terraform1.11.0:               ~ metadata {
17:35:03.563 STDOUT terraform1.11.0:                   ~ annotations      = {
17:35:03.563 STDOUT terraform1.11.0:                       - "kubectl.kubernetes.io/restartedAt" = "2025-12-23T13:15:00Z" -> null
17:35:03.563 STDOUT terraform1.11.0:                     }
17:35:03.563 STDOUT terraform1.11.0:                     name             = null
17:35:03.563 STDOUT terraform1.11.0:                     # (6 unchanged attributes hidden)
17:35:03.563 STDOUT terraform1.11.0:                 }
17:35:03.563 STDOUT terraform1.11.0:                 # (1 unchanged block hidden)
17:35:03.563 STDOUT terraform1.11.0:             }
17:35:03.563 STDOUT terraform1.11.0:             # (2 unchanged blocks hidden)
17:35:03.563 STDOUT terraform1.11.0:         }
17:35:03.563 STDOUT terraform1.11.0:         # (1 unchanged block hidden)
17:35:03.563 STDOUT terraform1.11.0:     }
17:35:03.563 STDOUT terraform1.11.0:   # kubernetes_namespace.kubero will be updated in-place
17:35:03.563 STDOUT terraform1.11.0:   # (imported from "kubero")
17:35:03.563 STDOUT terraform1.11.0:   ~ resource "kubernetes_namespace" "kubero" {
17:35:03.563 STDOUT terraform1.11.0:         id                               = "kubero"
17:35:03.564 STDOUT terraform1.11.0:       + wait_for_default_service_account = false
17:35:03.564 STDOUT terraform1.11.0:       ~ metadata {
17:35:03.564 STDOUT terraform1.11.0:             annotations      = {}
17:35:03.564 STDOUT terraform1.11.0:             generate_name    = null
17:35:03.564 STDOUT terraform1.11.0:             generation       = 0
17:35:03.564 STDOUT terraform1.11.0:           ~ labels           = {
17:35:03.564 STDOUT terraform1.11.0:               ~ "layer" = "L4" -> "platform"
17:35:03.564 STDOUT terraform1.11.0:             }
17:35:03.564 STDOUT terraform1.11.0:             name             = "kubero"
17:35:03.564 STDOUT terraform1.11.0:             resource_version = "1871178"
17:35:03.564 STDOUT terraform1.11.0:             uid              = "7d453e93-553d-4e3e-95d3-0015552f5a9f"
17:35:03.564 STDOUT terraform1.11.0:         }
17:35:03.564 STDOUT terraform1.11.0:     }
17:35:03.564 STDOUT terraform1.11.0:   # kubernetes_namespace.kubero_operator_system will be updated in-place
17:35:03.564 STDOUT terraform1.11.0:   # (imported from "kubero-operator-system")
17:35:03.564 STDOUT terraform1.11.0:   ~ resource "kubernetes_namespace" "kubero_operator_system" {
17:35:03.564 STDOUT terraform1.11.0:         id                               = "kubero-operator-system"
17:35:03.564 STDOUT terraform1.11.0:       + wait_for_default_service_account = false
17:35:03.564 STDOUT terraform1.11.0:       ~ metadata {
17:35:03.564 STDOUT terraform1.11.0:             annotations      = {}
17:35:03.564 STDOUT terraform1.11.0:             generate_name    = null
17:35:03.564 STDOUT terraform1.11.0:             generation       = 0
17:35:03.564 STDOUT terraform1.11.0:           ~ labels           = {
17:35:03.564 STDOUT terraform1.11.0:                 "control-plane" = "controller-manager"
17:35:03.564 STDOUT terraform1.11.0:               ~ "layer"         = "L4" -> "platform"
17:35:03.564 STDOUT terraform1.11.0:             }
17:35:03.564 STDOUT terraform1.11.0:             name             = "kubero-operator-system"
17:35:03.564 STDOUT terraform1.11.0:             resource_version = "1871162"
17:35:03.564 STDOUT terraform1.11.0:             uid              = "44f4d10f-28d5-4fde-85c0-2e654482af20"
17:35:03.564 STDOUT terraform1.11.0:         }
17:35:03.564 STDOUT terraform1.11.0:     }
17:35:03.564 STDOUT terraform1.11.0:   # kubernetes_namespace.observability will be updated in-place
17:35:03.564 STDOUT terraform1.11.0:   # (imported from "observability")
17:35:03.564 STDOUT terraform1.11.0:   ~ resource "kubernetes_namespace" "observability" {
17:35:03.564 STDOUT terraform1.11.0:         id                               = "observability"
17:35:03.564 STDOUT terraform1.11.0:       + wait_for_default_service_account = false
17:35:03.564 STDOUT terraform1.11.0:       ~ metadata {
17:35:03.564 STDOUT terraform1.11.0:             annotations      = {}
17:35:03.564 STDOUT terraform1.11.0:             generate_name    = null
17:35:03.565 STDOUT terraform1.11.0:             generation       = 0
17:35:03.565 STDOUT terraform1.11.0:           ~ labels           = {
17:35:03.565 STDOUT terraform1.11.0:               ~ "layer" = "L4" -> "platform"
17:35:03.565 STDOUT terraform1.11.0:             }
17:35:03.565 STDOUT terraform1.11.0:             name             = "observability"
17:35:03.565 STDOUT terraform1.11.0:             resource_version = "2064178"
17:35:03.565 STDOUT terraform1.11.0:             uid              = "29e8d27d-9894-4c50-8179-90d7526f756c"
17:35:03.565 STDOUT terraform1.11.0:         }
17:35:03.565 STDOUT terraform1.11.0:     }
17:35:03.565 STDOUT terraform1.11.0:   # kubernetes_secret.kubero_secrets will be updated in-place
17:35:03.565 STDOUT terraform1.11.0:   # (imported from "kubero/kubero-secrets")
17:35:03.565 STDOUT terraform1.11.0:   ~ resource "kubernetes_secret" "kubero_secrets" {
17:35:03.565 STDOUT terraform1.11.0:         binary_data_wo                 = (write-only attribute)
17:35:03.565 STDOUT terraform1.11.0:         data                           = (sensitive value)
17:35:03.565 STDOUT terraform1.11.0:         data_wo                        = (write-only attribute)
17:35:03.565 STDOUT terraform1.11.0:         id                             = "kubero/kubero-secrets"
17:35:03.565 STDOUT terraform1.11.0:         immutable                      = false
17:35:03.565 STDOUT terraform1.11.0:         type                           = "Opaque"
17:35:03.565 STDOUT terraform1.11.0:       + wait_for_service_account_token = true
17:35:03.565 STDOUT terraform1.11.0:         metadata {
17:35:03.565 STDOUT terraform1.11.0:             annotations      = {}
17:35:03.565 STDOUT terraform1.11.0:             generate_name    = null
17:35:03.565 STDOUT terraform1.11.0:             generation       = 0
17:35:03.565 STDOUT terraform1.11.0:             labels           = {}
17:35:03.565 STDOUT terraform1.11.0:             name             = "kubero-secrets"
17:35:03.565 STDOUT terraform1.11.0:             namespace        = "kubero"
17:35:03.565 STDOUT terraform1.11.0:             resource_version = "1871188"
17:35:03.565 STDOUT terraform1.11.0:             uid              = "d99e9e15-c324-4ed2-b090-ea6b57e4f19c"
17:35:03.565 STDOUT terraform1.11.0:         }
17:35:03.565 STDOUT terraform1.11.0:     }
17:35:03.565 STDOUT terraform1.11.0:   # kubernetes_service_account.kubero will be imported
17:35:03.565 STDOUT terraform1.11.0:     resource "kubernetes_service_account" "kubero" {
17:35:03.565 STDOUT terraform1.11.0:         automount_service_account_token = true
17:35:03.565 STDOUT terraform1.11.0:         default_secret_name             = null
17:35:03.565 STDOUT terraform1.11.0:         id                              = "kubero/kubero"
17:35:03.565 STDOUT terraform1.11.0:         metadata {
17:35:03.565 STDOUT terraform1.11.0:             annotations      = {}
17:35:03.565 STDOUT terraform1.11.0:             generate_name    = null
17:35:03.565 STDOUT terraform1.11.0:             generation       = 0
17:35:03.565 STDOUT terraform1.11.0:             labels           = {}
17:35:03.565 STDOUT terraform1.11.0:             name             = "kubero"
17:35:03.565 STDOUT terraform1.11.0:             namespace        = "kubero"
17:35:03.566 STDOUT terraform1.11.0:             resource_version = "1871187"
17:35:03.566 STDOUT terraform1.11.0:             uid              = "9cbf0707-2aaa-4ca9-a5b0-2ccfcc5a8fd8"
17:35:03.566 STDOUT terraform1.11.0:         }
17:35:03.566 STDOUT terraform1.11.0:     }
17:35:03.566 STDOUT terraform1.11.0:   # terraform_data.domain_config_check will be created
17:35:03.566 STDOUT terraform1.11.0:   + resource "terraform_data" "domain_config_check" {
17:35:03.566 STDOUT terraform1.11.0:       + id = (known after apply)
17:35:03.566 STDOUT terraform1.11.0:     }
17:35:03.566 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_namespaced[0] will be created
17:35:03.566 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_namespaced" {
17:35:03.566 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
17:35:03.566 STDOUT terraform1.11.0:       + id             = (known after apply)
17:35:03.566 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
17:35:03.566 STDOUT terraform1.11.0:       + name           = "admin/vault-admin"
17:35:03.566 STDOUT terraform1.11.0:     }
17:35:03.566 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_simple[0] will be created
17:35:03.566 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_simple" {
17:35:03.566 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
17:35:03.566 STDOUT terraform1.11.0:       + id             = (known after apply)
17:35:03.566 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
17:35:03.566 STDOUT terraform1.11.0:       + name           = "vault-admin"
17:35:03.566 STDOUT terraform1.11.0:     }
17:35:03.566 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_builtin[0] will be created
17:35:03.566 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_builtin" {
17:35:03.566 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
17:35:03.566 STDOUT terraform1.11.0:       + id             = (known after apply)
17:35:03.566 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
17:35:03.566 STDOUT terraform1.11.0:       + name           = "built-in/vault-developer"
17:35:03.566 STDOUT terraform1.11.0:     }
17:35:03.566 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_simple[0] will be created
17:35:03.566 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_simple" {
17:35:03.567 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
17:35:03.567 STDOUT terraform1.11.0:       + id             = (known after apply)
17:35:03.567 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
17:35:03.567 STDOUT terraform1.11.0:       + name           = "vault-developer"
17:35:03.567 STDOUT terraform1.11.0:     }
17:35:03.567 STDOUT terraform1.11.0:   # vault_identity_group_alias.viewer_namespaced[0] will be created
17:35:03.567 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "viewer_namespaced" {
17:35:03.567 STDOUT terraform1.11.0:       + canonical_id   = "89e06fbb-fc87-9471-ecc7-04b5747e4b06"
17:35:03.567 STDOUT terraform1.11.0:       + id             = (known after apply)
17:35:03.567 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
17:35:03.567 STDOUT terraform1.11.0:       + name           = "admin/vault-viewer"
17:35:03.567 STDOUT terraform1.11.0:     }
17:35:03.567 STDOUT terraform1.11.0: Plan: 7 to import, 56 to add, 7 to change, 0 to destroy.
17:35:03.567 STDOUT terraform1.11.0: 
17:35:03.567 STDOUT terraform1.11.0: Changes to Outputs:
17:35:03.567 STDOUT terraform1.11.0:   + kubero_session_secret          = (sensitive value)
17:35:03.567 STDOUT terraform1.11.0:   + kubero_ui_url                  = "https://kcloud.zitian.party"
17:35:03.567 STDOUT terraform1.11.0:   + platform_control_plane_status  = {
17:35:03.567 STDOUT terraform1.11.0:       + kubero_cr_deployed        = true
17:35:03.567 STDOUT terraform1.11.0:       + kubero_namespace          = "kubero"
17:35:03.567 STDOUT terraform1.11.0:       + kubero_operator_manifests = 50
17:35:03.567 STDOUT terraform1.11.0:       + kubero_secrets_synced     = true
17:35:03.567 STDOUT terraform1.11.0:       + observability_namespace   = "observability"
17:35:03.567 STDOUT terraform1.11.0:       + signoz_deployed           = true
17:35:03.567 STDOUT terraform1.11.0:     }
17:35:03.567 STDOUT terraform1.11.0:   + signoz_otel_endpoint           = "signoz-otel-collector.observability.svc.cluster.local:4317"
17:35:03.567 STDOUT terraform1.11.0:   + signoz_url                     = "https://signoz.zitian.party"
17:35:03.567 STDOUT terraform1.11.0: 
17:35:03.567 STDOUT terraform1.11.0: ─────────────────────────────────────────────────────────────────────────────
17:35:03.568 STDOUT terraform1.11.0: Saved the plan to:
17:35:03.568 STDOUT terraform1.11.0: ./platform-default.tfplan
17:35:03.568 STDOUT terraform1.11.0: To perform exactly these actions, run the following command to apply:
17:35:03.568 STDOUT terraform1.11.0:     terraform apply "./platform-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p platform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252Fplatform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p platform
  ```
Plan: 7 to import, 56 to add, 7 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```